УТ_для_edt/src/Documents/смартОбучениеСотрудников/смартОбучениеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартОбучениеСотрудников</name>
  <comment>#4898 смарт: Тимофеева 17.11.2025 / Создание механизма для учета квалификаций инженеров и менеджеров.</comment>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбучения</name>
    <type>
      <types>EnumRef.смартВидыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>CatalogRef.CRM_Помещения</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.смартСостоянияДокументовОбученияСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.смартПрограммыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПрограммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтражения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Квалификации</name>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.смартКвалификацииМенеджеров</types>
        <types>CatalogRef.смартУчебныеДисциплины</types>
        <types>CatalogRef.смартОборудованиеКлиентов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Преподаватели</name>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БронируемоеОборудование</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.демоОборудованиеДляДемонстрации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыОбучения</name>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.смартКвалификацииМенеджеров</types>
        <types>CatalogRef.смартУчебныеДисциплины</types>
        <types>CatalogRef.смартОборудованиеКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Зачет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗРР</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПНР</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредставителиКлиента</name>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Enums/смартСостоянияДокументовОбученияСотрудников/смартСостоянияДокументовОбученияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСостоянияДокументовОбученияСотрудников</name>
  <comment>#4898 смарт: Тимофеева 17.11.2025 / Создание механизма для учета квалификаций инженеров и менеджеров. </comment>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Планирование</name>
  </enumValues>
  <enumValues>
    <name>ОборудованиеЗарезервировано</name>
  </enumValues>
  <enumValues>
    <name>ПроходящиеОбучениеУказаны</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеРезультатов</name>
  </enumValues>
  <enumValues>
    <name>РезультатыОтражены</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартОбучениеСотрудников/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
///////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если Состояние = Перечисления.смартСостоянияДокументовОбученияСотрудников.ОборудованиеЗарезервировано
		И НЕ ЗначениеЗаполнено(Документы.смартОбучениеСотрудников.ПолучитьДокументБронирования(Ссылка)) Тогда 
		ОбщегоНазначения.СообщитьПользователю("Переход на этап ""Оборудование зарезервировано"" невозможен. Нет документа бронирования.", , "ФорматированнаяСтрокаДокументБронирования", , Отказ);
	КонецЕсли;
		
КонецПроцедуры 

Процедура ОбработкаУдаленияПроведения(Отказ)
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ИсключаемыеРеквизиты = Новый Массив;
	
	Если Состояние = Перечисления.смартСостоянияДокументовОбученияСотрудников.Черновик Тогда
		
		ИсключаемыеРеквизиты.Добавить("ДатаНачала");
		ИсключаемыеРеквизиты.Добавить("ДатаОкончания");
		ИсключаемыеРеквизиты.Добавить("ВидОбучения");
		ИсключаемыеРеквизиты.Добавить("МестоПроведения");
		ИсключаемыеРеквизиты.Добавить("Ответственный");
		ИсключаемыеРеквизиты.Добавить("ПрограммаОбучения");
		ИсключаемыеРеквизиты.Добавить("ОписаниеПрограммы");
		ИсключаемыеРеквизиты.Добавить("Партнер");
		
		ИсключаемыеРеквизиты.Добавить("Сотрудники");
		ИсключаемыеРеквизиты.Добавить("Сотрудники.Сотрудник");
		ИсключаемыеРеквизиты.Добавить("Преподаватели");
		ИсключаемыеРеквизиты.Добавить("Преподаватели.Преподаватель");
		ИсключаемыеРеквизиты.Добавить("БронируемоеОборудование");
		ИсключаемыеРеквизиты.Добавить("БронируемоеОборудование.Оборудование");
		ИсключаемыеРеквизиты.Добавить("Квалификации");
		ИсключаемыеРеквизиты.Добавить("Квалификации.Квалификация"); 
		ИсключаемыеРеквизиты.Добавить("ПредставителиКлиента");
		ИсключаемыеРеквизиты.Добавить("ПредставителиКлиента.КонтактноеЛицо");

		
	ИначеЕсли Состояние = Перечисления.смартСостоянияДокументовОбученияСотрудников.Планирование Тогда
		
		ИсключаемыеРеквизиты.Добавить("Сотрудники");
		ИсключаемыеРеквизиты.Добавить("Сотрудники.Сотрудник");
		ИсключаемыеРеквизиты.Добавить("Преподаватели");
		ИсключаемыеРеквизиты.Добавить("Преподаватели.Преподаватель"); 
		
		Если ТипЗнч(МестоПроведения) = Тип("СправочникСсылка.CRM_Помещения") Тогда 		
			ИсключаемыеРеквизиты.Добавить("БронируемоеОборудование");
			ИсключаемыеРеквизиты.Добавить("БронируемоеОборудование.Оборудование");	
		КонецЕсли;

	ИначеЕсли Состояние = Перечисления.смартСостоянияДокументовОбученияСотрудников.ОборудованиеЗарезервировано Тогда
		
		ИсключаемыеРеквизиты.Добавить("Сотрудники");
		ИсключаемыеРеквизиты.Добавить("Сотрудники.Сотрудник");
		ИсключаемыеРеквизиты.Добавить("Преподаватели");
		ИсключаемыеРеквизиты.Добавить("Преподаватели.Преподаватель");
		
		Если ТипЗнч(МестоПроведения) = Тип("СправочникСсылка.CRM_Помещения") Тогда 		
			ИсключаемыеРеквизиты.Добавить("БронируемоеОборудование");
			ИсключаемыеРеквизиты.Добавить("БронируемоеОборудование.Оборудование");	
		КонецЕсли;
		
	ИначеЕсли Состояние = Перечисления.смартСостоянияДокументовОбученияСотрудников.ПроходящиеОбучениеУказаны Тогда
		
		Если ТипЗнч(МестоПроведения) = Тип("СправочникСсылка.CRM_Помещения") Тогда 		
			ИсключаемыеРеквизиты.Добавить("БронируемоеОборудование");
			ИсключаемыеРеквизиты.Добавить("БронируемоеОборудование.Оборудование");	
		КонецЕсли;

	ИначеЕсли Состояние = Перечисления.смартСостоянияДокументовОбученияСотрудников.ОтражениеРезультатов Тогда
		
		Если ВидОтражения = 1 Тогда
			ИсключаемыеРеквизиты.Добавить("ДатаНачала");
			ИсключаемыеРеквизиты.Добавить("ДатаОкончания");
			ИсключаемыеРеквизиты.Добавить("ВидОбучения");
			ИсключаемыеРеквизиты.Добавить("МестоПроведения");
			ИсключаемыеРеквизиты.Добавить("ПрограммаОбучения");
			ИсключаемыеРеквизиты.Добавить("ОписаниеПрограммы");
			ИсключаемыеРеквизиты.Добавить("Партнер");
		
			ИсключаемыеРеквизиты.Добавить("Преподаватели");
			ИсключаемыеРеквизиты.Добавить("Преподаватели.Преподаватель");
			ИсключаемыеРеквизиты.Добавить("БронируемоеОборудование");
			ИсключаемыеРеквизиты.Добавить("БронируемоеОборудование.Оборудование");
			ИсключаемыеРеквизиты.Добавить("ПредставителиКлиента");
			ИсключаемыеРеквизиты.Добавить("ПредставителиКлиента.КонтактноеЛицо");
		
		КонецЕсли;
		
	ИначеЕсли Состояние = Перечисления.смартСостоянияДокументовОбученияСотрудников.РезультатыОтражены Тогда
		
		Если ВидОтражения = 1 Тогда
			ИсключаемыеРеквизиты.Добавить("ДатаНачала");
			ИсключаемыеРеквизиты.Добавить("ДатаОкончания");
			ИсключаемыеРеквизиты.Добавить("ВидОбучения");
			ИсключаемыеРеквизиты.Добавить("МестоПроведения");
			ИсключаемыеРеквизиты.Добавить("ПрограммаОбучения");
			ИсключаемыеРеквизиты.Добавить("ОписаниеПрограммы");
			ИсключаемыеРеквизиты.Добавить("Партнер");
		
			ИсключаемыеРеквизиты.Добавить("Преподаватели");
			ИсключаемыеРеквизиты.Добавить("Преподаватели.Преподаватель");
			ИсключаемыеРеквизиты.Добавить("БронируемоеОборудование");
			ИсключаемыеРеквизиты.Добавить("БронируемоеОборудование.Оборудование");
			ИсключаемыеРеквизиты.Добавить("ПредставителиКлиента");
			ИсключаемыеРеквизиты.Добавить("ПредставителиКлиента.КонтактноеЛицо");
			
		КонецЕсли;
	КонецЕсли;  
		
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ИсключаемыеРеквизиты);
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазы(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры  

#КонецОбласти

///////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");

#КонецЕсли
